0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 293;

boundaryField
{
    Inlet
    {
        type            totalTemperature;
        T0              uniform 293;
        gamma           1.4;
        value           uniform 293;
    }

    Outlet
    {
        type            zeroGradient;
    }

    FreestreamLeft
    {
        type            totalTemperature;
        T0              uniform 293;
        gamma           1.4;
        value           uniform 293;
    }

    FreestreamTop
    {
        type            totalTemperature;
        T0              uniform 293;
        gamma           1.4;
        value           uniform 293;
    }

    Wall
    {
    	type		zeroGradient; 
    }

    Wedge1
    {
        type            wedge;
    }

    Wedge2
    {
        type            wedge;
    }
}
// ************************************************************************* //
