0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    Inlet
    {
        type            zeroGradient;
    }

    Outlet
    {
        type            zeroGradient; // maybe the supersonic solver has a better one! for supersonic flow outlet
    }

    FreestreamLeft 
    {
        type            zeroGradient;
    }

    FreestreamTop
    {
        type            zeroGradient;
    }

    Wall
    {
    	type 		zeroGradient; 
    }

    Wedge1
    {
        type            wedge;
    }

    Wedge2
    {
        type            wedge;
    }
}


// ************************************************************************* //
