0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 102946; //Initial pressure in Pa (Huntsville ambient)

boundaryField
{
    Inlet
    {
        type            totalPressure; //is should be fine but if errors check totalPressure!	
	p0 		        uniform 550000; 
	value 		    uniform 550000;
    }

    Outlet
    {
        type            totalPressure;
        p0              uniform 102946;
        value 		    uniform 102946;
    }

    FreestreamLeft
    {
        type            totalPressure;
        p0              uniform 102946;
        value 		    uniform 102946;
    }

    FreestreamTop 
    {
        type            totalPressure;
        p0              uniform 102946;
        value 		    uniform 102946;
    }
    
    Wall
    {
    	type		zeroGradient; 
    }

    Wedge1
    {
        type            wedge;
        value           uniform 101325;  // or match the ambient pressure
    }

    Wedge2
    {
        type            wedge;
        value           uniform 101325;
    }

}


// ************************************************************************* //
